In [1]:
import numpy as np
import pandas as pd

*To read Excel Workbook:*

In [6]:
data = pd.read_excel('data.xlsx')

In [7]:
data

   Train No  Speed   Destination
0     22444    345  Muzaffargarh
1     55898    150        Gujrat
2      6657    200     Hyderabad

*To read second sheet:*

In [10]:
data=pd.read_excel('data.xlsx',sheet_name='Sheet2')

In [11]:
data

   Train Nos2  Speeds2 Destinations2
0       22444      345  Muzaffargarh
1       65898     1510        Gujrat
2        6657      200     Hyderabad

In [12]:
data.iloc[0,0]=34

In [13]:
data

   Train Nos2  Speeds2 Destinations2
0          34      345  Muzaffargarh
1       65898     1510        Gujrat
2        6657      200     Hyderabad

# Update the edited data into original sheet

In [14]:
data.to_excel('data.xlsx',sheet_name='Sheet2')